## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
a=[4,8,15,16,23,42]
pan_series=pd.Series(a)
print(pan_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
var_list=[1,2,3,4,5,6,7,8,9,10]
p_series=pd.Series(var_list)
print(p_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Q7. Create a DataFrame using multiple Series. Explain with an example.
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [8]:
data=[["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
df=pd.DataFrame(data,columns=['Name','Age','Gender'])
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### A Series only has one data column, whereas a single-column DataFrame contains both a data column and an index.
### Examlpe of series

In [19]:
info=["Maroof","Rahul","Hisham"]
ser=pd.Series(info)
print(ser)

0    Maroof
1     Rahul
2    Hisham
dtype: object

In [20]:
print(type(ser))

<class 'pandas.core.series.Series'>

In [24]:
s=pd.DataFrame(info,columns=['Name'])
print(s)

     Name
0  Maroof
1   Rahul
2  Hisham

In [25]:
type(s)

pandas.core.frame.DataFrame

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

### Pandas read_csv() Function - This function is used to retrieve data from CSV files in the form of a dataframe.
### Pandas head() Function	This function is used to return the top n (5 by default) values of a data frame or series.
### Pandas tail() Function	This method is used to return the bottom n (5 by default) rows of a data frame or series.
### Pandas sample() Function	This method is used to generate a sample random row or column from the data frame.
### Pandas dtypes() Function	This method returns a Series with the data type of each column.

In [26]:
df=pd.read_csv('titanic_data.csv')

In [27]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [28]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [30]:
df.sample(n=2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
393,394,1,1,"Newell, Miss. Marjorie",female,23.0,1,0,35273,113.275,D36,C
537,538,1,1,"LeRoy, Miss. Bertha",female,30.0,0,0,PC 17761,106.425,NaN,C

In [32]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

###  A Series is a one dimensional array like structure with homogeneous data. The values of the series are mutable means we can change any value in series, but the size of the series is immutable so we can not change the size of the series. A series can hold any type of data like integer, decimal, string, python objects, etc.
### DataFrame is a two-dimensional array with heterogeneous data. A DataFrame size is mutable and data is also mutable so we can change the data and size of DataFrame at any time.
###  The panel is a three-dimensional data structure with heterogeneous data. It is very hard to represent the Panel in a graphical representation. But a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [33]:
name=["Rahul","Ajit","Sohail","Kashif"]
age=[21,23,26,27]
n=pd.Series(name)
a=pd.Series(age)
f={'Name':n,
   'Age':a}
result=pd.DataFrame(f)
print(result)

     Name  Age
0   Rahul   21
1    Ajit   23
2  Sohail   26
3  Kashif   27

In [34]:
print(type(result))

<class 'pandas.core.frame.DataFrame'>